/*# P4414 [COCI 2006/2007 #2] ABC

## 题目描述

三个整数分别为 $A,B,C$。这三个数字不会按照这样的顺序给你，但它们始终满足条件：$A < B < C$。为了看起来更加简洁明了，我们希望你可以按照给定的顺序重新排列它们。

## 输入格式

第一行包含三个正整数 $A,B,C$，不一定是按这个顺序。这三个数字都小于或等于 $100$。第二行包含三个大写字母 $A$、$B$ 和 $C$（它们之间**没有**空格）表示所需的顺序。

## 输出格式

在一行中输出 $A$，$B$ 和 $C$，用一个 ` `（空格）隔开。

## 输入输出样例 #1

### 输入 #1

```
1 5 3
ABC
```

### 输出 #1

```
1 3 5
```

## 输入输出样例 #2

### 输入 #2

```
6 4 2
CAB
```

### 输出 #2

```
6 2 4
```*/
// P4414 ABC
#include<bits/stdc++.h>
using namespace std;
int main(){
    int P[3];
    int a,b,c;
    cin>>a>>b>>c;
    char x,y,z;
    cin>>x>>y>>z;
    P[0]=min(a,min(b,c));
    P[2]=max(a,max(b,c));
    P[1]=a+b+c-P[0]-P[2];
    cout<<P[x-65]<<" "<<P[y-65]<<" "<<P[z-65]<<endl;
    return 0;
}