/*# P5721 【深基4.例6】数字直角三角形

## 题目描述

给出 $n$，请输出一个直角边长度是 $n$ 的数字直角三角形。所有数字都是 $2$ 位组成的，如果没有 $2$ 位则加上前导 $0$。

## 输入格式

输入一个正整数 $n$。

## 输出格式

输出如题目要求的数字直角三角形。

## 输入输出样例 #1

### 输入 #1

```
5
```

### 输出 #1

```
0102030405
06070809
101112
1314
15
```

## 说明/提示

数据保证，$1\le n\le13$。*/
// P5721 数字直角三角形
#include<bits/stdc++.h>
using namespace std;
int main(){
    int n;
    cin>>n;
    int m=1;
    for(int i=n;i>0;i--){
        for(int j=1;j<=i;j++){
            printf("%02d",m); //输出两位数，前导补零
            m++;
        }
        cout<<"\n";
    }
    return 0;
}