/*# P5710 【深基3.例2】数的性质

## 题目描述

一些整数可能拥有以下的性质：

- 性质 1：是偶数；
- 性质 2：大于 $4$ 且不大于 $12$。

小 A 喜欢这两个性质同时成立的整数；Uim 喜欢这至少符合其中一种性质的整数；小 B 喜欢刚好有符合其中一个性质的整数；正妹喜欢不符合这两个性质的整数。现在给出一个整数 $x$，请问他们是否喜欢这个整数？

## 输入格式

输入一个整数 $x(0\le x \le 1000)$

## 输出格式

输出这 $4$ 个人是否喜欢这个数字，如果喜欢则输出 `1`，否则输出 `0`，用空格分隔。输出顺序为：小 A、Uim、小 B、正妹。

## 输入输出样例 #1

### 输入 #1

```
12
```

### 输出 #1

```
1 1 0 0
```*/
// P5710 数的性质
#include<bits/stdc++.h>
using namespace std;
int main(){
    int a=0;
    int b=0;
    int x;
    cin>>x;
    if(x%2==0) a=1;
    if(x>4&&x<=12) b=1;
    int A=0;
    int U=0;
    int B=0;
    int Z=0;
    if(a&&b) A=1;
    if(!a&&!b) U=0;
    else U=1;
    if((a&&!b)||(!a&&b)) B=1;
    if(a||b) Z=0;
    else Z=1;
    cout<<A<<" "<<U<<" "<<B<<" "<<Z<<endl;
    return 0;
}