/* # P1002 [NOIP 2002 普及组] 过河卒

## 题目描述

棋盘上 $A$ 点有一个过河卒，需要走到目标 $B$ 点。卒行走的规则：可以向下、或者向右。同时在棋盘上 $C$ 点有一个对方的马，该马所在的点和所有跳跃一步可达的点称为对方马的控制点。因此称之为“马拦过河卒”。

棋盘用坐标表示，$A$ 点 $(0, 0)$、$B$ 点 $(n, m)$，同样马的位置坐标是需要给出的。

![](https://cdn.luogu.com.cn/upload/image_hosting/ipmwl52i.png)

现在要求你计算出卒从 $A$ 点（不经过马的控制点）能够到达 $B$ 点的路径的条数，假设马的位置是固定不动的，并不是卒走一步马走一步。

## 输入格式

一行四个正整数，分别表示 $B$ 点坐标和马的坐标。

## 输出格式

一个整数，表示所有的路径条数。

## 输入输出样例 #1

### 输入 #1

```
6 6 3 3

```

### 输出 #1

```
6

```

## 说明/提示

对于 $100 \%$ 的数据，$1 \le n, m \le 20$，$0 \le$ 马的坐标 $\le 20$。

保证起点不是马的控制点。

**【题目来源】**

NOIP 2002 普及组第四题
*/
// P1002

#include<stdio.h>
int main(){
    int bx,by,mx,my;
    scanf("%d %d %d %d",&bx,&by,&mx,&my);
    long long a[25][25]={0}; // 棋盘大小
    int control[25][25]={0}; // 马的控制点
    int dx[9]={0,1,2,2,1,-1,-2,-2,-1};
    int dy[9]={0,2,1,-1,-2,-2,-1,1,2};
    for(int i=0;i<9;i++){
        int nx=mx+dx[i];
        int ny=my+dy[i];
        if(nx>=0&&nx<=bx&&ny>=0&&ny<=by){
            control[nx][ny]=1; // 标记马的控制位置
        }
    }
    a[0][0]=1;
    for(int i=0;i<=bx;i++){
        for(int j=0;j<=by;j++){
            if(control[i][j]){
                a[i][j]=0;
                continue;  // 如果是马的控制位置就跳过
            }
            if(i==0&&j==0) continue;
            if(i>0) a[i][j]+=a[i-1][j];
            if(j>0) a[i][j]+=a[i][j-1];
        }
    }
    printf("%lld",a[bx][by]);
    return 0;
}